#pragma once

/****************************************************************//**
*	\file Checkpoint.h
*	チェックポイント
********************************************************************/

//! チェックポイント
/****************************************************************//**
*	ヒロインが死亡したとき復活する位置のためのオブジェクト
*	\see CheckpointController
*	\nosubgrouping
********************************************************************/
class Checkpoint
{
	/************************************************************//**
	*	\name ﾗｲﾌ循環
	****************************************************************/
	/*@{*/
	public:
		Checkpoint(int rX, int rY) { mX = rX; mY = rY; }
		~Checkpoint(void) {}
	/*@}*/

	/************************************************************//**
	*	\name 使うﾒｿｯﾄﾞ
	*	処理に便利な機能を提供するﾒｿｯﾄﾞ。
	****************************************************************/	
	/*@{*/

		//! 復活位置の取得(X)
		int GetX() { return mX; }
		//! 復活位置の取得(Y)
		int GetY() { return mY; }

	/*@}*/


private:
	int mX;
	int mY;

};
