/****************************************************************//**
*	\file Collision.h
*	当たり判定用の図形ｸﾗｽ
********************************************************************/


#pragma once

class Collision;

//! 当たり判定図形の基本ｸﾗｽ
/****************************************************************//**
*	当たり判定の処理に使えるような図形の基本ｸﾗｽです。
*	このｸﾗｽを継承することで、あらゆる図形を作ることが出来ます。
*	\see Collidable
*	\nosubgrouping
********************************************************************/
class CollShape
{
public:
	/************************************************************//**
	*	\name ﾗｲﾌ循環
	****************************************************************/
	/*@{*/
	CollShape(Collision* rParent, int rGroupId);
	virtual ~CollShape(void);
	/*@}*/

	/************************************************************//**
	*	\name ｵｰﾊﾞｰﾗｲﾄﾞするﾒｿｯﾄﾞ
	****************************************************************/
	/*@{*/

	//! 他図形との当たり判定
	/************************************************************//**
	*	このﾒｿｯﾄﾞを実装する際に、rOperandを全ての可能な図形にｷｬｽﾄ
	*	を行って、元のｵﾌﾞｼﾞｪｸﾄを取得した後、双方の形に相当した判定
	*	を行います。
	*	\param rOperand 当たり判定先の図形ｵﾌﾞｼﾞｪｸﾄ
	*	\see Rect::Collides() Circle::Collides()
	****************************************************************/	
	virtual bool Collides(CollShape* rOperand) = 0;

	/*@}*/

	/************************************************************//**
	*	\name 無視するﾒｿｯﾄﾞ
	*	基本の場合は使用不要です。
	****************************************************************/
	/*@{*/

	Collision*	GetCollision();
	int			GetGroupId();

	/*@}*/

private:
	Collision* mParent;
	int	mGroupId;
};
