#pragma once

#include "Event.h"

/****************************************************************//**
*	\file CheckpointRestart.h
*	死んだ後の復活イベント
********************************************************************/

//! 復活
/****************************************************************//**
*	チートの基本インターフェース。\n
*	このクラスから継承することでチート行動を作ります。
*	\see Event
*	\nosubgrouping
********************************************************************/
class CheckpointRestart : public Event {

	/************************************************************//**
	*	\name ﾗｲﾌ循環
	****************************************************************/
	/*@{*/
	public:
		CheckpointRestart() {};
		~CheckpointRestart(void) {};
	/*@}*/

		//! \override
		void Trigger();

};