#pragma once

#include "Cheat.h"

//! ヒロインにダメージを与えるチート
/****************************************************************//**
*	\see Cheats
*	\nosubgrouping
********************************************************************/
class ChtDie : public Cheat
{
	public:
		ChtDie(int rKey);
		~ChtDie(void);

	/************************************************************//**
	*	\name 使うﾒｿｯﾄﾞ
	*	処理に便利な機能を提供するﾒｿｯﾄﾞ。
	****************************************************************/	
	/*@{*/
	
		void DoCheat();

	/*/}*/

};