#pragma once

#include "Cheat.h"

//! ヒロインは完全無敵になる
/****************************************************************//**
*	\see Cheats
*	\nosubgrouping
********************************************************************/
class ChtNoDamage: public Cheat
{
	public:
		ChtNoDamage(int rKey);
		~ChtNoDamage(void);

	/************************************************************//**
	*	\name 使うﾒｿｯﾄﾞ
	*	処理に便利な機能を提供するﾒｿｯﾄﾞ。
	****************************************************************/	
	/*@{*/
	
		void DoCheat();

	/*/}*/

};