#pragma once

#include <list>

using namespace std;

class Cheat;

/****************************************************************//**
*	\file CheatsController.h
*	チートキーの管理
********************************************************************/

//! チートキーを管理するオブジェクト
/****************************************************************//**
*	チートシステムの操作を提供するオブジェクト。
*
*	\nosubgrouping
********************************************************************/
class CheatsController 
{
	/************************************************************//**
	*	\name ﾗｲﾌ循環
	****************************************************************/
	/*@{*/
	public:
		CheatsController(void);
		~CheatsController(void);
	/*@}*/

	/************************************************************//**
	*	\name 使うﾒｿｯﾄﾞ
	*	処理に便利な機能を提供するﾒｿｯﾄﾞ。
	****************************************************************/	
	/*@{*/

	//! チートの追加
	void Add( Cheat* rAddMe );

	//! チートを有効・無効にする
	void SetActive( bool rOnOff );

	//! チートのトリッガー
	void CheckAndTrigger();

	/*@}*/


private:
	bool mActive;
	list<Cheat*> lstCheats;

};
