#pragma once

#include "Cheat.h"

//! ｷｰで指定されたｽﾃｰｼﾞに飛ぶ
/****************************************************************//**
*	\see Cheats
*	\nosubgrouping
********************************************************************/
class ChtJumpToStage : public Cheat
{
	public:
		ChtJumpToStage(int rKey);
		~ChtJumpToStage(void);

	/************************************************************//**
	*	\name 使うﾒｿｯﾄﾞ
	*	処理に便利な機能を提供するﾒｿｯﾄﾞ。
	****************************************************************/	
	/*@{*/
	
		void DoCheat();

	/*/}*/

};